# RebarSystemSpanSymbol Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarSystemSpanSymbol Class
Members See Also
---
Represents a Rebar System Span Symbol element in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RebarSystemSpanSymbol : IndependentTag
```

Visual Basic
---
```text
Public Class RebarSystemSpanSymbol _
	Inherits IndependentTag
```

Visual C++
---
```text
public ref class RebarSystemSpanSymbol : public IndependentTag
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..IndependentTag Autodesk.Revit.DB.Structure..::..RebarSystemSpanSymbol
# See Also
RebarSystemSpanSymbol Members
Autodesk.Revit.DB.Structure Namespace